// || - АБО

// Я піду гуляти під дощем якщо в мене буде парасолька або буду мити посуд

// в мене буде парасолька - true
// буду мити посуд - false

// Таблиця значент логічного оператора АБО

// true || false - true (ідем гуляти)
// false || true - true (ідем мити посуд)
// false || false - false
// true || true - true (Ми помили посуд щоб погуляти під дощем з парасолькою)

// && - І

// Ми можемо вивчити JS якщо будемо відвідувати заняття І Виконувати домашнє

// Таблиця значент логічного оператора &&

// true && false - false
// false && true - false
// false && false - false
// true && true - true

// ! - НЕ(використовується щоб отримати обернене значення)

console.log(!true); // false
console.log(!false); //true
